0x01-challenge/blog/app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body, :online))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Captain fantastic its a fantastic movies"], ["updated_at", 2020-10-04 20:02:29.806264545 UTC], ["id", 2]]

  def hide
    @post = Post.find(params[:id])
    @post.update(online: false)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "online" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["online", false], ["updated_at", 2020-10-04 20:59:48.680419538 UTC], ["id", 3]]

  def unhide
    @post = Post.find(params[:id])
    @post.update(online: true)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "online" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["online", true], ["updated_at", 2020-10-04 21:08:13.563269969 UTC], ["id", 2]]